MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/XMC1301-T038X0064/mcu.h
/* ---------------------------------  SHS_CALGC0  --------------------------------- */
#define SHS_CALGC0_CALGNVALS_Pos              (0UL)                     /*!< SHS CALGC0: CALGNVALS (Bit 0)                               */
#define SHS_CALGC0_CALGNVALS_Msk              (0x3fffUL)                /*!< SHS CALGC0: CALGNVALS (Bitfield-Mask: 0x3fff)               */
#define SHS_CALGC0_GNSWC_Pos                  (15UL)                    /*!< SHS CALGC0: GNSWC (Bit 15)                                  */
#define SHS_CALGC0_GNSWC_Msk                  (0x8000UL)                /*!< SHS CALGC0: GNSWC (Bitfield-Mask: 0x01)                     */
#define SHS_CALGC0_CALGNVALA_Pos              (16UL)                    /*!< SHS CALGC0: CALGNVALA (Bit 16)                              */
#define SHS_CALGC0_CALGNVALA_Msk              (0x3fff0000UL)            /*!< SHS CALGC0: CALGNVALA (Bitfield-Mask: 0x3fff)               */
#define SHS_CALGC0_GNAWC_Pos                  (31UL)                    /*!< SHS CALGC0: GNAWC (Bit 31)                                  */
#define SHS_CALGC0_GNAWC_Msk                  (0x80000000UL)            /*!< SHS CALGC0: GNAWC (Bitfield-Mask: 0x01)                     */

/* ---------------------------------  SHS_CALGC1  --------------------------------- */
#define SHS_CALGC1_CALGNVALS_Pos              (0UL)                     /*!< SHS CALGC1: CALGNVALS (Bit 0)                               */
#define SHS_CALGC1_CALGNVALS_Msk              (0x3fffUL)                /*!< SHS CALGC1: CALGNVALS (Bitfield-Mask: 0x3fff)               */
#define SHS_CALGC1_GNSWC_Pos                  (15UL)                    /*!< SHS CALGC1: GNSWC (Bit 15)                                  */
#define SHS_CALGC1_GNSWC_Msk                  (0x8000UL)                /*!< SHS CALGC1: GNSWC (Bitfield-Mask: 0x01)                     */
#define SHS_CALGC1_CALGNVALA_Pos              (16UL)                    /*!< SHS CALGC1: CALGNVALA (Bit 16)                              */
#define SHS_CALGC1_CALGNVALA_Msk              (0x3fff0000UL)            /*!< SHS CALGC1: CALGNVALA (Bitfield-Mask: 0x3fff)               */
#define SHS_CALGC1_GNAWC_Pos                  (31UL)                    /*!< SHS CALGC1: GNAWC (Bit 31)                                  */
#define SHS_CALGC1_GNAWC_Msk                  (0x80000000UL)            /*!< SHS CALGC1: GNAWC (Bitfield-Mask: 0x01)                     */

/* ---------------------------------  SHS_CALOC0  --------------------------------- */
#define SHS_CALOC0_CALOFFVAL0_Pos             (0UL)                     /*!< SHS CALOC0: CALOFFVAL0 (Bit 0)                              */
#define SHS_CALOC0_CALOFFVAL0_Msk             (0x7fUL)                  /*!< SHS CALOC0: CALOFFVAL0 (Bitfield-Mask: 0x7f)                */
#define SHS_CALOC0_CALOFFVAL1_Pos             (8UL)                     /*!< SHS CALOC0: CALOFFVAL1 (Bit 8)                              */
#define SHS_CALOC0_CALOFFVAL1_Msk             (0x7f00UL)                /*!< SHS CALOC0: CALOFFVAL1 (Bitfield-Mask: 0x7f)                */
#define SHS_CALOC0_OFFWC_Pos                  (15UL)                    /*!< SHS CALOC0: OFFWC (Bit 15)                                  */
#define SHS_CALOC0_OFFWC_Msk                  (0x8000UL)                /*!< SHS CALOC0: OFFWC (Bitfield-Mask: 0x01)                     */
#define SHS_CALOC0_CALOFFVAL2_Pos             (16UL)                    /*!< SHS CALOC0: CALOFFVAL2 (Bit 16)                             */
#define SHS_CALOC0_CALOFFVAL2_Msk             (0x7f0000UL)              /*!< SHS CALOC0: CALOFFVAL2 (Bitfield-Mask: 0x7f)                */
#define SHS_CALOC0_CALOFFVAL3_Pos             (24UL)                    /*!< SHS CALOC0: CALOFFVAL3 (Bit 24)                             */
#define SHS_CALOC0_CALOFFVAL3_Msk             (0x7f000000UL)            /*!< SHS CALOC0: CALOFFVAL3 (Bitfield-Mask: 0x7f)                */
#define SHS_CALOC0_DISCAL_Pos                 (31UL)                    /*!< SHS CALOC0: DISCAL (Bit 31)                                 */
#define SHS_CALOC0_DISCAL_Msk                 (0x80000000UL)            /*!< SHS CALOC0: DISCAL (Bitfield-Mask: 0x01)                    */

/* ---------------------------------  SHS_CALOC1  --------------------------------- */
#define SHS_CALOC1_CALOFFVAL0_Pos             (0UL)                     /*!< SHS CALOC1: CALOFFVAL0 (Bit 0)                              */
#define SHS_CALOC1_CALOFFVAL0_Msk             (0x7fUL)                  /*!< SHS CALOC1: CALOFFVAL0 (Bitfield-Mask: 0x7f)                */
#define SHS_CALOC1_CALOFFVAL1_Pos             (8UL)                     /*!< SHS CALOC1: CALOFFVAL1 (Bit 8)                              */
#define SHS_CALOC1_CALOFFVAL1_Msk             (0x7f00UL)                /*!< SHS CALOC1: CALOFFVAL1 (Bitfield-Mask: 0x7f)                */
#define SHS_CALOC1_OFFWC_Pos                  (15UL)                    /*!< SHS CALOC1: OFFWC (Bit 15)                                  */
#define SHS_CALOC1_OFFWC_Msk                  (0x8000UL)                /*!< SHS CALOC1: OFFWC (Bitfield-Mask: 0x01)                     */
#define SHS_CALOC1_CALOFFVAL2_Pos             (16UL)                    /*!< SHS CALOC1: CALOFFVAL2 (Bit 16)                             */
#define SHS_CALOC1_CALOFFVAL2_Msk             (0x7f0000UL)              /*!< SHS CALOC1: CALOFFVAL2 (Bitfield-Mask: 0x7f)                */
#define SHS_CALOC1_CALOFFVAL3_Pos             (24UL)                    /*!< SHS CALOC1: CALOFFVAL3 (Bit 24)                             */
#define SHS_CALOC1_CALOFFVAL3_Msk             (0x7f000000UL)            /*!< SHS CALOC1: CALOFFVAL3 (Bitfield-Mask: 0x7f)                */
#define SHS_CALOC1_DISCAL_Pos                 (31UL)                    /*!< SHS CALOC1: DISCAL (Bit 31)                                 */
#define SHS_CALOC1_DISCAL_Msk                 (0x80000000UL)            /*!< SHS CALOC1: DISCAL (Bitfield-Mask: 0x01)                    */

/* ---------------------------------  SHS_GNCTR00  -------------------------------- */
#define SHS_GNCTR00_GAIN0_Pos                 (0UL)                     /*!< SHS GNCTR00: GAIN0 (Bit 0)                                  */
#define SHS_GNCTR00_GAIN0_Msk                 (0xfUL)                   /*!< SHS GNCTR00: GAIN0 (Bitfield-Mask: 0x0f)                    */
#define SHS_GNCTR00_GAIN1_Pos                 (4UL)                     /*!< SHS GNCTR00: GAIN1 (Bit 4)                                  */
#define SHS_GNCTR00_GAIN1_Msk                 (0xf0UL)                  /*!< SHS GNCTR00: GAIN1 (Bitfield-Mask: 0x0f)                    */
#define SHS_GNCTR00_GAIN2_Pos                 (8UL)                     /*!< SHS GNCTR00: GAIN2 (Bit 8)                                  */
#define SHS_GNCTR00_GAIN2_Msk                 (0xf00UL)                 /*!< SHS GNCTR00: GAIN2 (Bitfield-Mask: 0x0f)                    */
#define SHS_GNCTR00_GAIN3_Pos                 (12UL)                    /*!< SHS GNCTR00: GAIN3 (Bit 12)                                 */
#define SHS_GNCTR00_GAIN3_Msk                 (0xf000UL)                /*!< SHS GNCTR00: GAIN3 (Bitfield-Mask: 0x0f)                    */
#define SHS_GNCTR00_GAIN4_Pos                 (16UL)                    /*!< SHS GNCTR00: GAIN4 (Bit 16)                                 */
#define SHS_GNCTR00_GAIN4_Msk                 (0xf0000UL)               /*!< SHS GNCTR00: GAIN4 (Bitfield-Mask: 0x0f)                    */
#define SHS_GNCTR00_GAIN5_Pos                 (20UL)                    /*!< SHS GNCTR00: GAIN5 (Bit 20)                                 */
#define SHS_GNCTR00_GAIN5_Msk                 (0xf00000UL)              /*!< SHS GNCTR00: GAIN5 (Bitfield-Mask: 0x0f)                    */
#define SHS_GNCTR00_GAIN6_Pos                 (24UL)                    /*!< SHS GNCTR00: GAIN6 (Bit 24)                                 */
#define SHS_GNCTR00_GAIN6_Msk                 (0xf000000UL)             /*!< SHS GNCTR00: GAIN6 (Bitfield-Mask: 0x0f)                    */
#define SHS_GNCTR00_GAIN7_Pos                 (28UL)                    /*!< SHS GNCTR00: GAIN7 (Bit 28)                                 */
#define SHS_GNCTR00_GAIN7_Msk                 (0xf0000000UL)            /*!< SHS GNCTR00: GAIN7 (Bitfield-Mask: 0x0f)                    */

/* ---------------------------------  SHS_GNCTR10  -------------------------------- */
#define SHS_GNCTR10_GAIN0_Pos                 (0UL)                     /*!< SHS GNCTR10: GAIN0 (Bit 0)                                  */
#define SHS_GNCTR10_GAIN0_Msk                 (0xfUL)                   /*!< SHS GNCTR10: GAIN0 (Bitfield-Mask: 0x0f)                    */
#define SHS_GNCTR10_GAIN1_Pos                 (4UL)                     /*!< SHS GNCTR10: GAIN1 (Bit 4)                                  */
#define SHS_GNCTR10_GAIN1_Msk                 (0xf0UL)                  /*!< SHS GNCTR10: GAIN1 (Bitfield-Mask: 0x0f)                    */
#define SHS_GNCTR10_GAIN2_Pos                 (8UL)                     /*!< SHS GNCTR10: GAIN2 (Bit 8)                                  */
#define SHS_GNCTR10_GAIN2_Msk                 (0xf00UL)                 /*!< SHS GNCTR10: GAIN2 (Bitfield-Mask: 0x0f)                    */
#define SHS_GNCTR10_GAIN3_Pos                 (12UL)                    /*!< SHS GNCTR10: GAIN3 (Bit 12)                                 */
#define SHS_GNCTR10_GAIN3_Msk                 (0xf000UL)                /*!< SHS GNCTR10: GAIN3 (Bitfield-Mask: 0x0f)                    */
#define SHS_GNCTR10_GAIN4_Pos                 (16UL)                    /*!< SHS GNCTR10: GAIN4 (Bit 16)                                 */
#define SHS_GNCTR10_GAIN4_Msk                 (0xf0000UL)               /*!< SHS GNCTR10: GAIN4 (Bitfield-Mask: 0x0f)                    */
#define SHS_GNCTR10_GAIN5_Pos                 (20UL)                    /*!< SHS GNCTR10: GAIN5 (Bit 20)                                 */
#define SHS_GNCTR10_GAIN5_Msk                 (0xf00000UL)              /*!< SHS GNCTR10: GAIN5 (Bitfield-Mask: 0x0f)                    */
#define SHS_GNCTR10_GAIN6_Pos                 (24UL)                    /*!< SHS GNCTR10: GAIN6 (Bit 24)                                 */
#define SHS_GNCTR10_GAIN6_Msk                 (0xf000000UL)             /*!< SHS GNCTR10: GAIN6 (Bitfield-Mask: 0x0f)                    */
#define SHS_GNCTR10_GAIN7_Pos                 (28UL)                    /*!< SHS GNCTR10: GAIN7 (Bit 28)                                 */
#define SHS_GNCTR10_GAIN7_Msk                 (0xf0000000UL)            /*!< SHS GNCTR10: GAIN7 (Bitfield-Mask: 0x0f)                    */


/* ================================================================================ */
/* ================          Group 'BCCU' Position & Mask          ================ */
/* ================================================================================ */


/* --------------------------------  BCCU_GLOBCON  -------------------------------- */
#define BCCU_GLOBCON_TM_Pos                   (0UL)                     /*!< BCCU GLOBCON: TM (Bit 0)                                    */
#define BCCU_GLOBCON_TM_Msk                   (0x1UL)                   /*!< BCCU GLOBCON: TM (Bitfield-Mask: 0x01)                      */
#define BCCU_GLOBCON_TRDEL_Pos                (2UL)                     /*!< BCCU GLOBCON: TRDEL (Bit 2)                                 */
#define BCCU_GLOBCON_TRDEL_Msk                (0xcUL)                   /*!< BCCU GLOBCON: TRDEL (Bitfield-Mask: 0x03)                   */
#define BCCU_GLOBCON_SUSCFG_Pos               (4UL)                     /*!< BCCU GLOBCON: SUSCFG (Bit 4)                                */
#define BCCU_GLOBCON_SUSCFG_Msk               (0x30UL)                  /*!< BCCU GLOBCON: SUSCFG (Bitfield-Mask: 0x03)                  */
#define BCCU_GLOBCON_TRAPIS_Pos               (6UL)                     /*!< BCCU GLOBCON: TRAPIS (Bit 6)                                */
#define BCCU_GLOBCON_TRAPIS_Msk               (0x3c0UL)                 /*!< BCCU GLOBCON: TRAPIS (Bitfield-Mask: 0x0f)                  */
#define BCCU_GLOBCON_TRAPED_Pos               (10UL)                    /*!< BCCU GLOBCON: TRAPED (Bit 10)                               */
#define BCCU_GLOBCON_TRAPED_Msk               (0x400UL)                 /*!< BCCU GLOBCON: TRAPED (Bitfield-Mask: 0x01)                  */
#define BCCU_GLOBCON_LTRS_Pos                 (12UL)                    /*!< BCCU GLOBCON: LTRS (Bit 12)                                 */
#define BCCU_GLOBCON_LTRS_Msk                 (0xf000UL)                /*!< BCCU GLOBCON: LTRS (Bitfield-Mask: 0x0f)                    */
#define BCCU_GLOBCON_WDMBN_Pos                (16UL)                    /*!< BCCU GLOBCON: WDMBN (Bit 16)                                */
#define BCCU_GLOBCON_WDMBN_Msk                (0xfff0000UL)             /*!< BCCU GLOBCON: WDMBN (Bitfield-Mask: 0xfff)                  */

/* --------------------------------  BCCU_GLOBCLK  -------------------------------- */
#define BCCU_GLOBCLK_FCLK_PS_Pos              (0UL)                     /*!< BCCU GLOBCLK: FCLK_PS (Bit 0)                               */
#define BCCU_GLOBCLK_FCLK_PS_Msk              (0xfffUL)                 /*!< BCCU GLOBCLK: FCLK_PS (Bitfield-Mask: 0xfff)                */
#define BCCU_GLOBCLK_BCS_Pos                  (15UL)                    /*!< BCCU GLOBCLK: BCS (Bit 15)                                  */
#define BCCU_GLOBCLK_BCS_Msk                  (0x8000UL)                /*!< BCCU GLOBCLK: BCS (Bitfield-Mask: 0x01)                     */
#define BCCU_GLOBCLK_DCLK_PS_Pos              (16UL)                    /*!< BCCU GLOBCLK: DCLK_PS (Bit 16)                              */
#define BCCU_GLOBCLK_DCLK_PS_Msk              (0xfff0000UL)             /*!< BCCU GLOBCLK: DCLK_PS (Bitfield-Mask: 0xfff)                */

